---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mesh
source: html/bed8f3c6-9d03-7bfd-cdf9-ca81fb339e81.htm
---
# Mesh Methods

Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the
 constituent facets of the mesh.